//--------------------------------------------------
//
//  QAAccordion (common motion)
//
//--------------------------------------------------

(function(){

  var gb = jp.co.preco

  function QAAccordion() {

    this.ready();
    this.run();
    this.setEvents();

  }

  QAAccordion.prototype = {

    ready: function() {

      // ------------------------------------------------------------
      //  dom取得
      // ------------------------------------------------------------

      // ------------------------------------------------------------
      //  非表示
      // ------------------------------------------------------------

      // ------------------------------------------------------------
      // sliderの準備
      // ------------------------------------------------------------
    },

    run: function() {

      $('.accordion .item').each(function(index, el) {

        new gb.QAAccordionItem($(this));
        
      });

    },

    setEvents: function() {

    },

  }

  // 公開api
  gb.QAAccordion = QAAccordion;
  
})();